# Pandas comparison with SQL

In [2]:
import pandas as pd
import numpy as np

using the tips data set found in pandas

In [3]:
url = 'https://raw.github.com/pandas-dev/pandas/master/pandas/tests/data/tips.csv'
pd_data = pd.read_csv(url)

pd_data.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

check some metadata about your dataframe

In [4]:
pd_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
total_bill    244 non-null float64
tip           244 non-null float64
sex           244 non-null object
smoker        244 non-null object
day           244 non-null object
time          244 non-null object
size          244 non-null int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.4+ KB

check some summary statistics about your dataset

In [5]:
pd_data.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [6]:
# SELECT statement

SELECT total_bill, sex, size from tips LIMIT 10

In [7]:
pd_data[['total_bill', 'sex', 'size']].head(5)

   total_bill     sex  size
0       16.99  Female     2
1       10.34    Male     3
2       21.01    Male     3
3       23.68    Male     2
4       24.59  Female     4

In [8]:
# WHERE statement

SQL filtering is done using the WHERE statement

SELECT * from tips WHERE size > 2

In [9]:
pd_data[pd_data['size'] > 2].head(5)

   total_bill   tip     sex smoker  day    time  size
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
7       26.88  3.12    Male     No  Sun  Dinner     4

In [10]:
# in pandas it seems you have to use the square bracket notation for filtration processes

In [11]:
# Square bracket notation

In [12]:
pd_data['size'].head(5)

0    2
1    3
2    3
3    2
4    4
Name: size, dtype: int64

In [13]:
#select multiple columns from a given table where filtering

SQL  SELECT size, sex FROM tips WHERE size > 2

In [14]:
pd_data[['size','sex']] [pd_data['size']>2].head(5)

   size     sex
1     3    Male
2     3    Male
4     4  Female
5     4    Male
7     4    Male

In [15]:
# select multiple columns from a given table where filtering and another filtering

SELECT size, sex FROM tips WHERE size >2 AND sex = 'Male'

In [16]:
pd_data[['size', 'sex']][(pd_data['size']>2)&(pd_data['sex']=='Male')].head(5)

    size   sex
1      3  Male
2      3  Male
5      4  Male
7      4  Male
13     4  Male

In [17]:
# The above code passes a series of true/false booleans to the dataframe returning all the raws that are true

This is a series

In [18]:
pd_data['size'].head(7)

0    2
1    3
2    3
3    2
4    4
5    4
6    2
Name: size, dtype: int64

This is also a series

In [19]:
pd_data['size']<2

0      False
1      False
2      False
3      False
4      False
5      False
6      False
7      False
8      False
9      False
10     False
11     False
12     False
13     False
14     False
15     False
16     False
17     False
18     False
19     False
20     False
21     False
22     False
23     False
24     False
25     False
26     False
27     False
28     False
29     False
       ...
214    False
215    False
216    False
217    False
218    False
219    False
220    False
221    False
222     True
223    False
224    False
225    False
226    False
227    False
228    False
229    False
230    False
231    False
232    False
233    False
234    False
235    False
236    False
237    False
238    False
239    False
240    False
241    False
242    False
243    False
Name: size, Length: 244, dtype: bool

In [20]:
pd_data[pd_data['size']>2].head(5)

   total_bill   tip     sex smoker  day    time  size
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
7       26.88  3.12    Male     No  Sun  Dinner     4

In [21]:
pd_data[['size', 'sex','smoker']][(pd_data['size']>2)&(pd_data['sex']=='Female')&(pd_data['smoker']=='Yes')]

     size     sex smoker
102     3  Female    Yes
186     3  Female    Yes
188     3  Female    Yes
197     4  Female    Yes
205     3  Female    Yes
214     3  Female    Yes
219     4  Female    Yes

In [22]:
# SQL OR

SELECT sex, smoker FROM tips WHERE size >=2 OR sex = 'Female'

In [23]:
pd_data[['sex', 'smoker']][(pd_data['size']>=2) | (pd_data['sex']=='Female')]

        sex smoker
0    Female     No
1      Male     No
2      Male     No
3      Male     No
4    Female     No
5      Male     No
6      Male     No
7      Male     No
8      Male     No
9      Male     No
10     Male     No
11   Female     No
12     Male     No
13     Male     No
14   Female     No
15     Male     No
16   Female     No
17     Male     No
18   Female     No
19     Male     No
20     Male     No
21   Female     No
22   Female     No
23     Male     No
24     Male     No
25     Male     No
26     Male     No
27     Male     No
28     Male     No
29   Female     No
..      ...    ...
213  Female    Yes
214  Female    Yes
215  Female    Yes
216    Male    Yes
217    Male    Yes
218    Male    Yes
219  Female    Yes
220    Male    Yes
221  Female    Yes
223  Female     No
224    Male    Yes
225  Female    Yes
226  Female    Yes
227    Male     No
228    Male     No
229  Female    Yes
230    Male    Yes
231    Male    Yes
232    Male     No
233    Male     No
234    Male    Yes
235    Male     No
236    Male    Yes
237    Male    Yes
238  Female     No
239    Male     No
240  Female    Yes
241    Male    Yes
242    Male     No
243  Female     No

[243 rows x 2 columns]

In [24]:
# SQL NOT NULL & NULL

SELECT * FROM tips WHERE sex IS NULL

In [25]:
pd_data[pd_data['sex'].isna()]

Empty DataFrame
Columns: [total_bill, tip, sex, smoker, day, time, size]
Index: []

SELECT * FROM tips WHERE sex NOT NULL

In [26]:
pd_data[pd_data['sex'].notna()].head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [27]:
# GROUP BY

Group by typically refers to spliting data set into groups, apply some function typically aggregation then 
combine the groups together

SELECT sex, count(*) FROM tips GROUP BY sex

In [28]:
pd_data.groupby('sex').sum()

        total_bill     tip  size
sex
Female     1570.95  246.51   214
Male       3256.82  485.07   413

In [29]:
pd_data.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [30]:
pd_data.groupby(['sex', 'day', 'time']).sum()

                    total_bill     tip  size
sex    day  time
Female Fri  Dinner       71.55   14.05    10
            Lunch        55.76   10.98     9
       Sat  Dinner      551.05   78.45    63
       Sun  Dinner      357.70   60.61    53
       Thur Dinner       18.78    3.00     2
            Lunch       516.11   79.42    77
Male   Fri  Dinner      164.41   21.23    16
            Lunch        34.16    5.70     5
       Sat  Dinner     1227.35  181.95   156
       Sun  Dinner     1269.46  186.78   163
       Thur Lunch       561.44   89.41    73

Notice summing adds the interger values while count literally counts the frequency of the columns specified

In [31]:
pd_data.groupby('sex').count()

        total_bill  tip  smoker  day  time  size
sex
Female          87   87      87   87    87    87
Male           157  157     157  157   157   157

In [32]:
pd_data[['sex']].count()

sex    244
dtype: int64

In [33]:
pd_data[pd_data['sex']=='Female'].count()

total_bill    87
tip           87
sex           87
smoker        87
day           87
time          87
size          87
dtype: int64

In [34]:
pd_data.groupby('sex')['sex'].count()

sex
Female     87
Male      157
Name: sex, dtype: int64

In [35]:
pd_data[pd_data['sex'].isna()]

Empty DataFrame
Columns: [total_bill, tip, sex, smoker, day, time, size]
Index: []

SELECT tip COUNT(*) FROM tips WHERE tip<100 GROUP BY sex

Remember the groupby will need a column that is SELECTED

In [38]:
pd_data[['tip','sex']][pd_data['tip']<100].groupby('sex').sum()

           tip
sex
Female  246.51
Male    485.07

Remember the selected column shall appear withs the values in the dataframe
Remember only the selected column(s) shall appear

In [43]:
some_dataframe = pd_data[['day','tip','total_bill']][pd_data['tip']<100].groupby('day').sum()

In [44]:
some_dataframe

         tip  total_bill
day
Fri    51.96      325.88
Sat   260.40     1778.40
Sun   247.39     1627.16
Thur  171.83     1096.33

In [ ]:
SELECT day, tip COUNT(day) FROM tips WHERE tip < 100 GROUPBY day

In [45]:
pd_data[['day', 'tip']][pd_data['tip']<100].groupby('day').count()

      tip
day
Fri    19
Sat    87
Sun    76
Thur   62

remember sum shall sum the columns with integer values

In [ ]:
#pd_data[['day','tip']].max()
#pd

In [ ]:
# which days have the highest tips

In [ ]:
# Step 1. Check hi

In [47]:
pd_data[['day','tip']].nlargest(3,'tip')

     day    tip
170  Sat  10.00
212  Sat   9.00
23   Sat   7.58

In [46]:
pd_data.nlargest(3,'tip')

     total_bill    tip   sex smoker  day    time  size
170       50.81  10.00  Male    Yes  Sat  Dinner     3
212       48.33   9.00  Male     No  Sat  Dinner     4
23        39.42   7.58  Male     No  Sat  Dinner     4

In [ ]:
# which day had the highest total bill by the males who are not smokers

In [48]:
pd_data[['day','sex','smoker','total_bill']][(pd_data['sex']=='Male')&(pd_data['smoker']=='No')].nlargest(1, 'total_bill')

     day   sex smoker  total_bill
212  Sat  Male     No       48.33

In [ ]:
# which day had the highest total bill by the males who are smokers

In [ ]:
SELECT day, sex, smoker, total_bill FROM tip

In [49]:
pd_data[['day','sex','smoker','total_bill']][(pd_data['sex']=='Male')&(pd_data['smoker']=='Yes')].nlargest(1, 'total_bill')

     day   sex smoker  total_bill
170  Sat  Male    Yes       50.81

In [ ]:
# Which sex smokes the most

SELECT sex, smoker COUNT(sex) WHERE smoker = 'Yes' GROUPBY sex

In [67]:
pd_data[['sex','smoker']][pd_data['smoker']=='Yes'].groupby('sex').count()

        smoker
sex
Female      33
Male        60

In [63]:
# What time is the total_bill highest. What time do people spend the most

SELECT time, total_bill SUM (total_bill) FROM tip GROUPBY time

In [65]:
pd_data[['time', 'total_bill']].groupby('time').sum()

        total_bill
time
Dinner     3660.30
Lunch      1167.47

In [68]:
# What is the avarage tip amount by day

SELECT tip, day SUM(tip) GROUP BY day

In [90]:
pd_data[['day', 'tip']].groupby('day').agg({np.mean, np.sum})

           tip
          mean     sum
day
Fri   2.734737   51.96
Sat   2.993103  260.40
Sun   3.255132  247.39
Thur  2.771452  171.83

# Applying multiple functions to a dataframe using agg{}

In [82]:
# What day of the week has the highest total bill and what is the average total bill in that day

SELECT day, total_bill, AVG(total_bill), SUM(total_bill) FROM tip GROUP BY day

In [104]:
pd_data[['day', 'total_bill']].groupby('day').agg({np.mean, np.sum})

     total_bill
           mean      sum
day
Fri   17.151579   325.88
Sat   20.441379  1778.40
Sun   21.410000  1627.16
Thur  17.682742  1096.33

In [109]:
# Checking the frequency of an element in a column NB Used on series types only

In [110]:
pd_data['day'].value_counts()

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64